{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "IdeficsForVisionText2Text",
    "parent_library": "transformers.models.idefics.modeling_idefics"
  },
  "base_model_name_or_path": "HuggingFaceM4/idefics-9b-instruct",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "k_proj",
    "q_proj",
    "v_proj"
  ],
  "task_type": null
}